wsig/examples/xml/MathService-testSum.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://www.w3.org/2000/10/XMLSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns0:sum xmlns:ns0="urn:MathService" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<firstElement xsi:type="q0:float">2</firstElement> 
			<secondElement xsi:type="q0:float">3</secondElement> 
		</ns0:sum>
	</soapenv:Body>
</soapenv:Envelope>